[
    {
        "title": "Harden 'just as shocked as you guys' by CP3 news - ESPN",
        "url": "https://www.espn.com/nba/story/_/id/47197695/james-harden-kawhi-leonard-shocked-chris-paul-abrupt-ouster-clippers",
        "published_at": "2025-12-04T05:42:00Z",
        "source": "ESPN",
        "body": "Shams Charania breaks down the Chris Paul-Ty Lue drama and the point guard's departure from the Clippers. (1:04)\n\nOpen Extended Reactions\n\nATLANTA -- LA Clippers stars James Harden and Kawhi Leonard were \"shocked\" when they found out Wednesday morning that Chris Paul would no longer be their teammate.\n\nThe Clippers made the stunning overnight decision to part ways with Paul after a three-hour late-night conversation between Clippers president of basketball operations Lawrence Frank and Paul at the team hotel in Atlanta.\n\nHarden and Leonard couldn't believe their eyes when they saw the news on their phones.\n\n\"I'm just as confused and shocked as you guys, the world,\" Harden said Wednesday night after the Clippers beat the Atlanta Hawks 115-92 to snap a five-game losing streak. \"Definitely surprised me. But not just Chris, it's a lot that we were dealing with. But that is out of my hands. I got to focus on what I got to focus on and what I can control. I guess the front office felt that was the best decision for the organization.\"\n\nLeonard said he almost had to reread the news.\n\n\"It was shocking to me,\" Leonard said. \"I guess they had a conversation, and front office made a decision.\"\n\nSources told ESPN's Shams Charania that Paul was not on speaking terms with Clippers coach Ty Lue for several weeks before the veteran point guard's abrupt ouster.\n\nPaul and his leadership style clashed with Lue and the Clippers, according to sources, who told Charania that the 12-time All-Star was vocal in holding management, coaches and players accountable. The Clippers believed Paul's style had become disruptive, sources told Charania.\n\nFrank said Wednesday that the organization's decision to part with Paul did not stem from one isolated incident and that the sides had more than one conversation before Paul was informed he would no longer be a part of the team.\n\nLue was asked whether Paul's departure helps the Clippers.\n\n\"I don't think it necessarily helped our team,\" Lue said before Wednesday's game. \"I mean, I don't think the reason why we're 5-16 is because of CP's play. I just think that it wasn't a good fit for what he was looking for. Do I want to see CP go out like this? No, I have a lot of respect for him. He's been a friend of mine over the years, and you don't want to see a great go out like this.\n\n\"I'm pretty sure he will find something because he's a great player. [But] I didn't want to see it end like this.\"\n\nPaul, one of the greatest players in Clippers franchise history, will retire at the end of this season, his 21st in the NBA, sources told Charania.\n\n\"Don't have a side [in this],\" Lue said. \"I don't like it. It just didn't work out like we thought it would. I don't like it for CP. It just wasn't a good fit, and we understood that. It was an organization [decision], they made the choice, and so moving forward, we got to see what we do.\"\n\nFor now, the Clippers and Paul are in a holding pattern, despite the guard being sent home to Los Angeles. Because Paul signed a one-year, $3.6 million contract in July, he is not eligible to be traded until Dec. 15 at the earliest.\n\nWaiving him outright is more complicated. Because the Clippers are $1.3 million below the first apron and are not allowed to exceed it in any transaction, they are unable to sign a replacement unless they convert two-way player Kobe Sanders. By league rules, a team is not allowed to fall below 14 players for 14 consecutive days.\n\nThe Clippers and Paul could entertain a buyout of his remaining salary. However, that would require a team to have a roster spot to sign him. Of the 10 teams with a spot available, only the Hawks are not impacted by the luxury tax and apron.\n\nESPN's Bobby Marks contributed to this report."
    },
    {
        "title": "People worldwide don’t know enough about menopause. Here’s why that’s dangerous - CNN",
        "url": "https://www.cnn.com/2025/12/04/world/menopause-global-ignorance-dangers-explained-as-equals-wellness-intl",
        "published_at": "2025-12-04T05:00:59Z",
        "source": "CNN",
        "body": "EDITOR’S NOTE: This story is part of As Equals, CNN’s ongoing series on gender inequality. For information about how the series is funded and more, check out our FAQs.\n\nThirty-eight-year-old Rosy Devi’s body aches most of the time, short walks have become difficult, she loses her breath easily, has chest pain and feels her health is generally getting worse. It has been a gradual decline, she says, since her hysterectomy in 2019 which led to her prematurely going through menopause.\n\n“I am walking and suddenly feel intense heat in my body and start sweating. And I get chest pain, like someone has hit me in the back,” says the mother of four who lives in India’s eastern state of Bihar. She never imagined the menopause, the time of life a woman stops getting her period permanently, would take such a toll on her body. “Now I am really feeling old. I mean, I feel that I have really become old… The body, the face, everything has changed,” she says.\n\nFor Devi, menopause was also something she expected to experience much later in life, not because of surgery, so the whole thing came as quite a surprise, she admits.\n\nBut it’s a change that affects half the world’s population at some stage, and Devi’s symptoms are some of the wider-ranging and lesser-known effects that come with it.\n\nSymptoms such as hot flashes and mood changes are well known, and often stereotyped, but experts worldwide want to highlight that women face a huge range of changes to their bodies during the menopause – and lack of awareness means many will start experiencing symptoms without knowing why.\n\nHere’s what everyone needs to know.\n\nWhat is menopause – and why don’t people know enough about it?\n\nMenopause is when women experience an end to their periods, or menstruation, for more than 12 months, and it marks the end of their reproductive years.\n\nGlobally, most women experience menopause between the ages of 45 and 55, according to the World Health Organization (WHO). But a study of women in the United States and South Korea found that up to 9.4% of people (around 1 in 10) experience it between 40 and 44, while for up to 8.6% of people it happens before the age of 40. In very rare cases, women can go through menopause as early as their 20s. For some, it can occur following a full hysterectomy, including the removal of the ovaries, or due to other medical reasons.\n\nIn the case of natural menopause, the first stage is perimenopause. This is when the ovaries gradually produce fewer hormones, affecting menstrual cycles. Symptoms include irregular periods, hot flashes (also known as hot flushes), sleep disruption and mood changes.\n\nPerimenopause can begin as early as in the mid-30s, lasting for about four to eight years, but many women can’t recall when this started for them, explains Gayathri Delanerolle, a researcher with Hampshire and Isle of Wight Healthcare NHS Foundation Trust in the UK. In qualitative interviews, some women remember the exact time they experienced a hot flash or their sleep began to get worse, but others have no idea, she tells CNN. “Menopause has not even been on the radar.”\n\nStudies show that most women know little about menopause. One, which surveyed more than 800 postmenopausal women, the majority based in the UK, found that over 90% of them had never been taught about menopause at school, and almost half said they felt completely uninformed about it. The women also shared that their doctors lacked adequate knowledge, leaving them feeling “dismissed and unsupported” after their consultations. Other studies produced similar findings.\n\nJoyce Harper, a professor at University College London’s Institute of Women’s Health, who co-authored the study, told the College news outlet, the result shows “women have a lack of education about this key life stage… Together with a reported lack of education from their healthcare professionals, women may be left undiagnosed and unsupported.”\n\nMenopause can happen in many ways and at different times\n\nMenopause is classified as “premature” when it occurs before age 40, and “early” before the age 45.\n\nResearch suggests, across low and middle-income countries, rates of early and premature menopause have risen and that the average age of menopause has fallen.\n\n“If you get menopause early in your lifespan, you are struggling with that for a longer period of time,” says Nikita Rajput, a scientific officer at Tata Memorial Centre’s Centre for Cancer Epidemiology in Navi Mumbai, India. Her research found that women in rural India faced “limited healthcare access, low awareness and higher rates of premature menopause,” she tells CNN.\n\nOther forms of menopause include surgical, which is triggered by a hysterectomy to remove the uterus and ovaries, and medical menopause, where treatments such as chemotherapy or radiation therapy may affect the functioning of the ovaries and result in the onset of menopause.\n\nHealth experts in India have raised concerns about high rates of premature and early menopause in the country with research indicating its link to hysterectomies. This is particularly the case among young women from low-income, less educated and rural backgrounds. Rajput tells CNN that when these women are suffering with gynaecological disorders such as excessive bleeding or fibroids, they feel forced into hysterectomies, possibly under pressure from their husband or in-laws, or even doctors who may suggest the surgery as the first course of action. Research shows many women are unaware of the extent of the procedures they’ve had.\n\nYukari Schrickel/CNN\n\nThe symptoms of menopause vary from person to person\n\nThe most common symptoms of menopause are hot flashes and night sweats, occurring in 80% of cases, according to The Menopause Society in the US, but other common symptoms include vaginal dryness, urinary urgency, insomnia, and mood changes, including depression and irritability.\n\n“Lots of women have also reported headaches, migraines…and difficulty sleeping or staying asleep,” says Delanerolle. Many also experience incontinence which then impacts other aspects of their life, including work and exercising.\n\nAdditionally, women may face symptoms such as heart palpitations, joint and muscle ache, changes in sex drive, poor concentration, weight gain and hair loss, according to the Mayo Clinic.\n\nOther less common symptoms include dry eyes, while some women also report changes to their vision. They may also find themselves bruising more easily and suffer dry mouth or acne.\n\nDelanerolle says she has come across other symptoms in her research, including itchy scalp and itchy skin. Some women in India and the UK even reported an increase in libido, she adds.\n\n“Menopause can be a highly individualized journey,” says Delanerolle, and because some symptoms are common in other health conditions, “sometimes it may not be possible to definitively think that these are related to menopause.”\n\nShe believes what’s needed is comprehensive research, public awareness campaigns, including in schools, and evidence-based training for health care professionals.\n\nWhy is it dangerous that women don’t know enough about menopause?\n\nMenopause and its symptoms last for around seven years on average, according to the Cleveland Clinic, and it’s important for women to be able to understand and identify what they are going through.\n\nWomen also have an increased risk of cardiovascular disease following menopause, making it important that they become more active and manage their diet. This is because menopause causes a significant drop in estrogen – which works in regulating cholesterol and fat – increasing the risk of developing coronary heart disease or suffering a heart attack or stroke, according to the British Heart Foundation. Heart disease is the leading cause of death in women worldwide.\n\nMultiple studies also show a greater risk of respiratory conditions such as chronic obstructive pulmonary disease (COPD) following menopause, particularly premature menopause.\n\nOm Kurmi, associate professor in epidemiology and healthcare research at Coventry University in the UK, says greater awareness will help women get the correct support, and make the changes required in their lifestyle, to mitigate the health risks menopause brings with it.\n\nFor example, lifestyle changes like quitting smoking, reducing alcohol consumption, increasing exercise, reducing stress levels and losing weight can help with symptoms and combat the heightened risk of conditions such as osteoporosis and heart disease. Another area is mental health, which Kurmi says is “not discussed at all.” While symptoms of menopause such as irritability, mood swings and insomnia are well documented, there is also a heightened risk of depression and anxiety, as recent studies show.\n\nWomen “need to recognize, if you’re having menopause, the likelihood of having certain health problems is higher compared to those who don’t,” Kurmi tells CNN. “Once you understand your symptoms … (these) can be managed well.”\n\nYukari Schrickel/CNN\n\nHow can women manage menopause symptoms? And does this differ globally?\n\nThe most prescribed care option for menopause worldwide is hormone therapy, also known as hormone replacement therapy or HRT, which works by replacing the hormones that have decreased inside the body. One is estrogen therapy – typically given to women who have had hysterectomies – and a second type is a combination of the hormones estrogen and progesterone, offered to others. Hormone therapy is thought to help mitigate symptoms and risks associated with menopause, and treatment typically lasts between two to five years, sometimes even longer. Stopping treatment may bring back menopausal symptoms.\n\nBut these therapies are more available in high-income countries due to cost, access to health care services, and knowledge among practitioners to then prescribe it. However, disparity is also seen within high-income countries, with the financially better off tending to have greater access.\n\nThere are some known side effects of hormone therapy, including irregular vaginal bleeding and breast tenderness, and an increased risk of blood clots and gall bladder disease. There is also a slight increase in the risk of breast, ovarian and endometrial (womb) cancer, but according to Cancer Research UK, the risk remains small, and depends on many factors, such as the type of therapy, how long someone is on it, their age and their general health and lifestyle. Experts saythat women should weigh all their options and decide, which can only happen if they have choices and information to hand.\n\nThere are also medications which may be prescribed to manage specific symptoms, such as antidepressants to treat hot flashes. Many women prefer to take a more natural route, with several herbal supplements claiming to help manage symptoms like hot flashes and sleep disruption. However, these are not generally recommended by health authorities due to a lack of evidence as to their efficacy and safety. Other options include taking vitamin supplements and making lifestyle changes such as quitting smoking, losing weight and regular exercise, which may be easier options for women in low-income settings.\n\nAn analysis of research from the US and five European countries found that most women who had moderate to severe symptoms made lifestyle changes to manage them. The most prescribed treatment was hormone therapy, followed by anti-depressants.\n\nIn the US, a recent decision to remove “scary black box warning” labelling on HRT products may see more women choosing the treatment. The country’s Food and Drug Administration decided to remove the “black box” warning stating the increased risks of diseases like breast cancer and dementia, saying the move was “to stop the fear machine steering women away from this life-changing, even life-saving, treatment,” according to the FDA Commissioner Dr Marty Makary.\n\nWhy women (and men) and policymakers need to sit up and pay attention\n\n“The population is increasing, the lifespan is increasing, and that means women, 50% of the global population, are increasing as well,” says Kurmi. And with women living longer than men, the UN’s World Population Prospects 2024 says there is a need to prioritize “gender-specific health care needs,” and build stronger “social support systems to mitigate potential caregiving burdens.”\n\nWith more women who “are over 40 years, 50 years nowadays,” Kurmi, who is part of a team of researchers looking at the urgent need for attention on menopause, tells CNN there will be an increase in menopause-related health issues.\n\nHealth services in many low and middle-income countries, like India, still focus most of their budget for women on sexual and reproductive health, due to problems such as high maternal mortality rates, which the Indian government says is a “critical public health issue.” But a growing number of older women are also in need of care, and policies are yet to address their needs. “The government only knows women as a reproductive person, not post-reproductive. She’s not a woman, or she is only defined by her uterus,” says Rajput. What is required is a post-reproductive health policy and scheme, she explains.\n\nThe persistent stigma around menopause also needs addressing.\n\n“The perception around menopause needs to change. And a large part of that comes with awareness,” says Delanarelle of the UK NHS trust. She believes that teaching teenage girls about menopause in school can make a difference because “as they grow up…they understand that menopause is not the end of the line for them. It’s another chapter. You’ve got a book, and menopause is another chapter.”\n\nCredits\n\nCommissioning Editor: Meera Senthilingam\n\nWriter: Sashikala VP\n\nCopy Editor: Hannah Strange\n\nVisual Editors: Carlotta Dotto and Elisa Solinas\n\nIllustrator: Yukari Schrickel"
    },
    {
        "title": "Survivors in boat strike were trying to climb back onto vessel before follow-up attack, source says - CBS News",
        "url": "https://www.cbsnews.com/news/survivors-boat-strike-were-trying-to-climb-back-onto-vessel-before-follow-up-attack/",
        "published_at": "2025-12-04T04:24:00Z",
        "source": "CBS News",
        "body": "Two people who survived the U.S. military's early September strike on an alleged drug-carrying vessel were attempting to climb back onto the boat before it was hit a second time, a source familiar with the matter told CBS News on Wednesday.\n\nThe survivors allegedly tried to salvage some of the drugs, according to the source. They appeared to be in communication with others at the time, and there were other boats in the vicinity that could have picked them up, the head of Special Operations Command Admiral Mitch Bradley was expected to tell lawmakers on Thursday, the source said.\n\nABC News was first to report the additional details on the strike. Defense Secretary Pete Hegseth reposted a video of ABC News' report on X.\n\nThe Sept. 2 mission — the first of more than 20 attacks on alleged drug boats by the Trump administration in recent months — has drawn bipartisan scrutiny since last week, when The Washington Post reported that the military carried out at least two strikes on the same boat in the Caribbean, killing a pair of survivors from the initial hit. The newspaper alleged in its report that the second strike was conducted because Hegseth had said that everybody on board the boat should be killed.\n\nThe White House confirmed this week that there was a second strike, but denied that Hegseth ordered it. Hegseth has said the decision was made by Bradley, the mission's commander, and argued the follow-up strike was legal and justified.\n\nBradley and Gen. Dan Caine, chairman of the Joint Chiefs of Staff, walked lawmakers through a video of the second strike in classified testimony on Thursday before the House and Senate Armed Services and Intelligence committees. Bradley testified that Hegseth didn't issue an order for everybody to be killed, multiple lawmakers later told reporters.\n\nMembers of Congress offered divergent views on the video. Democratic Rep. Jim Himes of Connecticut called it \"one of the most troubling things I've seen in my time in public service,\" describing the two survivors as people \"in clear distress\" who were \"not in the position to continue their mission in any way.\" But Republican Sen. Tom Cotton of Arkansas said he \"didn't see anything disturbing about it,\" adding the survivors appeared to be \"trying to flip a boat loaded with drugs bound for the United States back over so they could stay in the fight.\"\n\nDemocrats and some legal experts have alleged the second strike may have constituted a war crime under U.S. and international law if the military targeted survivors. A Pentagon manual on the law of war says \"wounded, sick, or shipwrecked\" combatants no longer pose a threat and should not be attacked.\n\nEven before the recent revelations, the campaign of boat strikes had drawn broader legal questions, with critics arguing the president doesn't have the authority to order military operations against alleged traffickers without congressional approval. In the past, the U.S. has typically sought to interdict drug smugglers at sea, essentially treating them like criminals rather than combatants. The Trump administration has argued the strikes are lawful because the U.S. is engaged in a \"non-international armed conflict\" with drug cartels that it views as terrorist organizations.\n\nLawmakers from both parties have vowed to investigate the Sept. 2 strike."
    },
    {
        "title": "What to know about Minnesota fraud allegations, as Trump levels attacks on Walz - CBS News",
        "url": "https://www.cbsnews.com/news/what-to-know-about-minnesota-fraud-allegations-as-trump-levels-attacks-on-walz/",
        "published_at": "2025-12-04T03:24:26Z",
        "source": "CBS News",
        "body": "A series of multimillion-dollar alleged fraud schemes in Minnesota has drawn the Trump administration's attention in recent weeks, vaulting an issue that has brewed in state politics for years into the national conversation.\n\nPresident Trump has called Minnesota a \"hub of fraudulent money laundering activity,\" and has lashed out against the state's Somali community as most of the fraud defendants were of Somali descent — drawing stiff criticism from local officials. This week, the administration launched enhanced immigration operations in the Minneapolis-St. Paul area.\n\nMeanwhile, U.S. House Republicans launched an investigation Wednesday into Democratic Gov. Tim Walz's handling of the fraud cases, and the U.S. Treasury said Monday it will look into whether tax dollars from Minnesota made their way to al Shabaab, a Somali-based al Qaeda affiliate. And federal prosecutors have continued to bring new charges against alleged fraudsters in the Midwestern state in recent months.\n\nHere's what to know about the cases:\n\nWhat was the Feeding Our Future fraud scheme?\n\nThree years ago, federal prosecutors in Minnesota filed the first charges in what they described as the \"largest pandemic fraud in the United States.\"\n\nThe $250 million scheme — which now includes upward of 75 defendants — revolved around a nonprofit group called Feeding Our Future that partnered with the Minnesota Department of Education and U.S. Department of Agriculture to distribute meals to children.\n\nDuring the COVID-19 pandemic, prosecutors say, Feeding Our Future and its affiliated food distribution sites submitted fake meal count sheets and invoices to trick state and federal officials into thinking they had helped serve food to thousands of children. The group allegedly raked in millions in administrative fees for the fake meal distributions, and got kickbacks from people who ran their distribution sites, according to federal charging documents.\n\nFeeding Our Future's founder, Aimee Bock, was convicted at trial earlier this year. Several other defendants, including distribution site operators, have pleaded guilty or been convicted, in some cases receiving multiyear prison sentences and being ordered to pay millions in restitution. One defendant also pleaded guilty to attempting to bribe a juror, after a member of the jury in his fraud trial found a bag with $120,000 in cash at her home.\n\nBock has long denied wrongdoing. At various points before charges were filed, Minnesota officials questioned some of the group's filings and slowed approvals of distribution sites, leading Feeding Our Future to file a lawsuit accusing the state of discrimination.\n\nThe case was part of a trend of large-scale fraud across the U.S. during the pandemic, as the federal government poured money into assistance programs at a rapid clip. One former federal watchdog estimated to \"60 Minutes\" earlier this year that COVID-19 fraud may have cost taxpayers some $1 trillion.\n\nProsecutors said the program that was allegedly co-opted by Feeding Our Future — the Federal Child Nutrition Program — became more vulnerable to fraud during the pandemic. Oversight was more difficult because of the health crisis, and federal officials waived some of the program's rules to let restaurants participate and allow off-site meal distribution.\n\nA probe last year by the state's Office of the Legislative Auditor found the Minnesota Department of Education \"created opportunities for fraud\" by failing to act on warning signs with Feeding Our Future or investigate complaints about the group.\n\nThe report also found that state officials felt they needed to handle Feeding Our Future carefully because the group had responded to a 2020 slowdown in food site approvals by accusing the Minnesota Department of Education of racial discrimination and of depriving needy children of food. In the Feeding Our Future's lawsuit against the state, it noted that it \"caters to members of a protected group of racial minorities and foreign nationals.\"\n\nThe auditor's office said \"the threat of legal consequences and negative media attention affected MDE's decisions about the regulatory actions it did and did not take against Feeding Our Future.\"\n\nWhat other fraud allegations have circulated in Minnesota?\n\nThe Feeding Our Future scheme isn't the only fraud case to rattle Minnesota politics.\n\nIn August, state officials shut down a fairly new program designed to help seniors and people with disabilities find housing after discovering \"large-scale fraud.\"\n\nA month later, federal prosecutors charged eight people with allegedly defrauding the program, which was run through the state's Medicaid service, by enrolling as providers and submitting millions in \"fake and inflated bills.\"\n\nProsecutors said the housing stabilization program was susceptible to fraud because it intentionally had \"low barriers to entry\" and few recordkeeping requirements. They also noted that spending on the program had ballooned to more than $100 million last year, despite initial estimates that it would cost around $2.6 million a year.\n\nAnd in late September, a person was charged with defrauding a third state program — in this case, one that provides services to children with autism. Her company was accused of hiring unqualified \"behavioral technicians\" and submitting false claims to the state that indicated the staff had worked with children enrolled in the program.\n\nShe also allegedly paid kickbacks to parents who agreed to enroll their children in the program, in some cases sending them as much as $1,500, prosecutors said.\n\nThe same person, Asha Farhan Hassan, was also charged in September with running a fraudulent food distribution site as part of the Feeding Our Future scheme.\n\nActing U.S. Attorney Joseph H. Thompson said the case \"is not an isolated scheme.\"\n\n\"From Feeding Our Future to Housing Stabilization Services and now Autism Services, these massive fraud schemes form a web that has stolen billions of dollars in taxpayer money,\" the federal prosecutor wrote in a statement.\n\nKelly Loeffler, who leads the U.S. Small Business Administration, also alleged Tuesday that some of the groups linked to the Feeding Our Future scheme received COVID-era emergency loans. She said she has ordered an \"investigation into the network of Somali organizations and executives implicated in these schemes.\" She did not provide details on the probe.\n\nWhat is the connection to Minnesota's Somali community?\n\nMost of the people charged in the Feeding Our Future case are of Somali descent, though Bock, the group's founder and the scheme's alleged \"mastermind,\" is White.\n\nProsecutors in the alleged autism services fraud scheme said the defendant \"approached parents in the Somali community to recruit their children.\"\n\nThe named fraud defendants appear to represent a small percentage of Minnesota's Somali American community, which is among the largest in the nation.\n\nSome 76,000 people of Somali descent live in the state, more than half of whom were born in the U.S., according to Census Bureau figures from last year. The vast majority of the state's foreign-born Somali population has U.S. citizenship, and most entered the U.S. before 2010.\n\nAround 65% of Somali people in Minnesota ages 16 and over were employed as of last year, according to the Census Bureau, roughly equivalent to the state population as a whole.\n\nLast year, a Somali American former investigator in the Minnesota attorney general's office, Kayseh Magan, wrote about what he called an \"uncomfortable and true\" reality that many people who have been charged with fraud in the state are of Somali descent.\n\nHe wrote that \"fraud occurs when desire meets opportunity,\" noting that many Somali Americans are \"poor, desperate and seek shortcuts,\" and their families in the impoverished East African country frequently rely on money from their U.S.-based relatives. He said Somali service providers often leverage trust within the community to recruit friends and relatives into their programs. Many victims of these fraud schemes are Somali, too, he added.\n\nHas Minnesota taxpayer money made its way to the terror group al Shabaab?\n\nTreasury Secretary Scott Bessent said earlier this week that his department will investigate whether tax dollars from Minnesota's public assistance programs made their way to al Shabaab, an affiliate of al Qaeda and a U.S.-designated foreign terrorist organization based in Somalia.\n\nBessent appeared to be responding to a report in the conservative magazine City Journal that alleged millions from state programs \"ultimately landed in the hands of the terror group Al-Shabaab,\" citing law enforcement sources.\n\nThose allegations have circulated for years. A 2019 report by the state's Office of the Legislative Auditor said it was \"unable to substantiate\" allegations that Child Care Assistance Program funding is going to terrorist groups, though the report didn't rule it out, saying it's \"possible\" that state funds may have been sent overseas and eventually found its way to terrorists.\n\nMultiple federal investigators told CBS News Minnesota's Jonah Kaplan that there is no evidence taxpayer dollars were funneled to al Shabaab.\n\nAndy Lugar, a Biden- and Obama-era U.S. attorney for Minnesota, told The Minnesota Star Tribune last month that those charged in the Feeding Our Future fraud scheme \"were looking to get rich, not fund overseas terrorism.\"\n\nWhat has President Trump said?\n\nMr. Trump has blamed the fraud schemes on Somali people, whom he has attacked in often incendiary terms in recent weeks. On Tuesday, the president called immigrants from Somalia \"garbage,\" and claimed they \"destroyed Minnesota\" and \"contribute nothing.\"\n\nLast month, the president announced he would end temporary deportation protections for Somali immigrants who live in Minnesota, claiming without evidence that \"Somali gangs are terrorizing the people of that great State,\" and that Minnesota has become a \"hub of fraudulent money laundering activity.\"\n\nSomalia is also one of 19 countries that have faced near-total travel bans and a halt to immigration applications. And Immigration and Customs Enforcement operations are underway this week in the Minneapolis area, CBS News has reported.\n\nA particular focus of Mr. Trump's ire is Rep. Ilhan Omar, a Minnesota Democrat who was born in Somalia and came to the U.S. as a teenager. He has also lashed out at Walz, whom he referred to last week using a slur for people with intellectual disabilities.\n\nMinnesota lawmakers and members of the state's Somali community have castigated Mr. Trump for the comments. In an interview with \"Meet The Press\" last weekend, Walz said the fraud issue \"is totally disconnected with demonizing an entire group of people who came here, fleeing civil war, and created a vibrant community that makes Minnesota and this country better.\"\n\nWhat has Minnesota Gov. Tim Walz said about the fraud schemes?\n\nWalz, who has served as Minnesota's governor since 2019, told NBC's \"Meet The Press\" on Sunday that his state has sought to crack down on fraud. He also pointed to the state's generosity.\n\n\"Minnesota is a generous state. Minnesota is a prosperous state, a well-run state. We're AAA-bond rated,\" said the governor and 2024 Democratic vice presidential nominee. \"But that attracts criminals. Those people are going to jail. We're doing everything we can.\"\n\nAsked this week about the U.S. Treasury's investigation into claims that tax money may have gone to al Shabaab, Walz said the state welcomes federal help and wants to crack down on fraud, but added: \"I don't think anybody in here really believes their motive and their timing,\" referring to the Trump administration and congressional Republicans.\n\nMeanwhile, the governor and his administration have faced years of local scrutiny over their handling of fraud, dating back to the Feeding Our Future scheme's emergence in 2022. Republican officials have long argued the state failed to carry out due diligence and was slow to act in that scheme — though Walz has insisted the state caught the fraud early but was stymied by court battles and asked by the FBI not to cut off payments during its investigation.\n\nThat scrutiny has resurged in recent weeks. Earlier Wednesday, Republican Rep. James Comer of Kentucky, the chair of the House Oversight Committee, opened an investigation into fraud in Minnesota's public assistance programs.\n\n\"The Committee has serious concerns about how you as the Governor, and the Democrat-controlled administration, allowed millions of dollars to be stolen,\" Comer said in a letter requesting documents from Walz. \"The Committee also has concerns that you and your administration were fully aware of this fraud and chose not to act for fear of political retaliation.\""
    },
    {
        "title": "Quentin Tarantino: Paul Dano Is 'Weakest Male Actor in SAG' - The Hollywood Reporter",
        "url": "http://www.hollywoodreporter.com/movies/movie-news/quentin-tarantino-paul-dano-weakest-actor-there-will-be-blood-1236441966/",
        "published_at": "2025-12-04T03:18:15Z",
        "source": "Hollywood Reporter",
        "body": "Quentin Tarantino is not impressed with Paul Dano‘s performance in Paul Thomas Anderson‘s There Will Be Blood.\n\nDuring a recent appearance on The Bret Easton Ellis Podcast, the two-time Academy Award winner shared his list of the best movies of the 21st century. Tarantino ranked the 2007 Western-thriller at No. 5, noting that it “would stand a better chance to be in number one or number two if it didn’t have a big giant flaw in it.”\n\n“And the flaw is Paul Dano,” Tarantino said on The Bret Easton Ellis Podcast, via People. “Obviously, it’s supposed to be a two-hander, and it’s also so drastically obvious that it’s not a two-hander. … He is weak sauce, man. He’s a weak sister.”\n\nThe director commended Daniel Day-Lewis‘ performance in There Will Be Blood, which notably earned him an Oscar. “Daniel Day-Lewis shows that he doesn’t need [a strong foil in the movie]. He doesn’t need anything. The movie would’ve had more — there would’ve been more stringiness to the beef. And again, it’s supposed to be a two-hander, and it’s not,” he said.\n\nEllis argued that Day-Lewis’ portrayal of the role of Daniel Plainview was “so gargantuan” that it may have overtaken Dano. Tarantino responded to his theory, saying, “So you put him with the weakest male actor in SAG? The limpest dick in the world?”\n\nThe Hollywood Reporter reached out to representatives for Dano and did not hear back by the time of publication.\n\n“I’m not saying he’s giving a terrible performance,” Tarantino continued. “I’m saying he’s giving a non-entity [performance]. I don’t care for him. I don’t care for Owen Wilson, I don’t care for Matthew Lillard.”\n\nThere Will Be Blood earned two Academy Awards: one for Day-Lewis in the best actor category and another for cinematography. The film picked up a total of eight nods, with THR predicting its awards success in a 2007 review.\n\n“Built around another powerhouse performance by Daniel Day-Lewis, it’s a certain awards contender and will be a strong draw for serious moviegoers,” John DeFore wrote, later adding, “Daniel Day-Lewis stuns in Paul Thomas Anderson’s saga of a soul-dead oil man.”"
    },
    {
        "title": "How Belgium became Russia’s most valuable asset - politico.eu",
        "url": "https://www.politico.eu/article/belgium-russia-bart-de-wever-moscow-funds-brussels-bank-ukraine-war/",
        "published_at": "2025-12-04T03:00:00Z",
        "source": "POLITICO.eu",
        "body": "But as the nights draw in, the mood is darkening.\n\nAmid delays and continuing failure to agree on a way forward, bad-tempered briefings have been aimed at De Wever, and increasingly also at von der Leyen in recent weeks. She has held off the decisive step of publishing the draft legal texts that would enable the assets to be used for the reparations loan. These documents are what all sides need to enact, alter or reject the plan.\n\n“We have wasted a lot of time,” Jonatan Vseviov, secretary-general of the Estonian foreign ministry, told POLITICO. “Our focus has been solely on the Commission president, asking her to present the proposal. Nobody else can table the proposal.” He said it would have been “better” if the Commission had produced the legal texts setting out the details of the loan earlier than Wednesday, when they were eventually released.\n\n“We have wasted a lot of time,” Jonatan Vseviov, secretary-general of the Estonian foreign ministry, told POLITICO. | Ali Balikci/Getty Images\n\n“We all have a responsibility” to speed up now, another diplomat said, while a third noted that even Belgium had been imploring the Commission to publish the legal plans in recent weeks. An EU official said everyone should calm down and noted that De Wever still needed to get off his ledge. Another diplomat said Belgium “cannot expect all their wishes to be granted in full.”\n\nWinter is here\n\nMerz is particularly agitated. He worries that it will be his country’s taxpayers who have to step in unless the assets loan goes ahead. “I see the need to do this as increasingly urgent,” the German leader told reporters on Friday. “Ukraine needs our support. Russian attacks are intensifying. Winter is approaching — or rather, we are already in winter.”\n\nDe Wever, in the words of one diplomat, is still “pleading” for other options to remain in play. Two alternative ideas are in the air. The first would ask EU national governments to dig into their own coffers to send cash grants to Kyiv, a prospect most involved think is unrealistic given the parlous state of the budgets of many European nations."
    },
    {
        "title": "Steve Cropper, guitarist and member of Stax Records' Booker T and the M.G.'s, dies - NPR",
        "url": "https://www.npr.org/2025/12/03/g-s1-100557/steve-cropper-guitarist-stax-records-dead",
        "published_at": "2025-12-04T01:43:58Z",
        "source": "NPR",
        "body": "Steve Cropper, guitarist and member of Stax Records' Booker T and the M.G.'s, dies\n\ntoggle caption Mark Humphrey/AP\n\nMEMPHIS, Tenn. — Steve Cropper, the lean, soulful guitarist and songwriter who helped anchor the celebrated Memphis backing band Booker T. and the M.G.'s at Stax Records and co-wrote the classics \"Green Onions,\" \"(Sittin' on) the Dock of the Bay\" and \"In the Midnight Hour,\" has died. He was 84.\n\nPat Mitchell Worley, president and CEO of the Soulsville Foundation, said Cropper's family told her that Cropper died on Wednesday in Nashville. The foundation operates the Stax Museum of American Soul Music in Memphis, located at the site of the former Stax Records, where Cropper worked for years.\n\nSponsor Message\n\nA cause of death was not immediately known. Longtime associate Eddie Gore said he was with Cropper on Tuesday at a rehabilitation facility in Nashville, where Cropper had been after a recent fall. Cropper had been working on new music when Gore visited, he said.\n\n\"He's such a good human,\" Gore said. \"We were blessed to have him, for sure.\"\n\nThe guitarist, songwriter and record producer was not known for flashy playing, but his spare, catchy licks and solid rhythm chops helped define Memphis soul music. At a time when it was common for white musicians to co-opt the work of Black artists and make more money from their songs, Cropper was that rare white artist willing to keep a lower profile and collaborate.\n\n'Play it, Steve!'\n\nCropper's very name was immortalized in the 1967 smash \"Soul Man,\" recorded by Sam & Dave. Midway, singer Sam Moore calls out \"Play it, Steve!\" as Cropper pulls off a tight, ringing riff, a slide sound that Cropper used a Zippo lighter to create. The exchange was reenacted in the late 1970s when Cropper joined the John Belushi-Dan Aykroyd act \"The Blues Brothers\" and played on their hit cover of \"Soul Man.\"\n\nIn a 2020 interview with The Associated Press, Cropper discussed his career and how he mastered the art of filling gaps with an essential lick or two.\n\nSponsor Message\n\n\"I listen to the other musicians and the singer,\" Cropper said. \"I'm not listening to just me. I make sure I'm sounding OK before we start the session. Once we've presented the song, then I listen to the song and the way they interpret it. And I play around all that stuff. That's what I do. That's my style.\"\n\nRolling Stones guitarist Keith Richards, asked once about Cropper, said simply, \"Perfect, man.\" On a YouTube instructional video, guitar virtuoso Joe Bonamassa says Cropper's moves are often copied.\n\n\"If you haven't heard the name Steve Cropper, you've heard him in song,\" Bonamassa said.\n\nHe got his first guitar at 14\n\nCropper was born near Dora, Missouri, but moved with his family to Memphis when he was 9 and got his first mail-order guitar at age 14, according to his website, playitsteve.com. Chuck Berry, Jimmy Reed and Chet Atkins were among his early influences.\n\nCropper was a Stax artist before the label was even called Stax, which Jim Stewart and Estelle Axton had founded as Satellite Records in 1957. In the early 1960s, Satellite signed up Cropper and his instrumental band the Royals Spades. The band soon changed its name to the Mar-Keys and had a hit with \"Last Night.\"\n\nSatellite soon was later renamed Stax, where some of the Mar-Keys became the label's horn section while Cropper and other Mar-Keys formed Booker T. and the M.G.'s. Featuring Cropper, keyboard player Booker T. Jones, bassist Donald \"Duck\" Dunn and drummer Al Jackson, they were known for their hit instrumentals \"Green Onions,\" \"Hang 'Em High\" and \"Time Is Tight,\" and backed Otis Redding, Sam & Dave and others.\n\nThe racially integrated band, a rarity in its day, was so admired that even non-Stax artists recorded with them, notably Wilson Pickett. Jones, who is the only surviving member of the band, and Jackson are Black. Dunn and Cropper are white.\n\nSponsor Message\n\n\"When you walked in the door at Stax, there was absolutely no color,\" Cropper said in the AP interview. \"We were all there for the same reason — to get a hit record.\"\n\nInspired by gospel song\n\nIn the mid-1960s, Atlantic Records executive Jerry Wexler brought Pickett to work with the Stax musicians. During a 2015 gathering with the National Music Publishers Association, Cropper acknowledged he had never heard of Pickett before working with him. He found some gospel recordings by Pickett, was taken by the line \"I'll see my Jesus in the midnight hour\" and with a slight change helped write a secular standard.\n\n\"The man up there has been forgiving me for this ever since!\" he said.\n\nCropper was inducted into the Rock and Roll Hall of Fame in 1992 as a member of Booker T. and the M.G.'s. That year, Cropper, Dunn and Jones played in an all-star tribute at Madison Square Garden to Bob Dylan. Al Jackson died in 1975, Dunn in 2012.\n\nRolling Stone magazine ranked Cropper 39th on its 100 Greatest Guitarists list, calling him \"the secret ingredient in some of the greatest rock and soul songs.\"\n\nCropper was especially close to Redding. In an interview on his website, Cropper recalled collaborating on \"(Sittin' on) the Dock of the Bay,\" completed shortly before Redding's death in a December 1967 plane crash and a No. 1 hit in 1968.\n\nThe brooding, folkish ballad was a bittersweet reflection on his triumphant appearance a few months earlier at the Monterey Pop Festival. Cropper would remember adding the final touches on the recording while still grieving for Redding.\n\n\"We had been looking for the crossover song,\" he said. \"This song, we knew we had it.\"\n\nCropper was in the 1980 movie \"The Blues Brothers\" and its follow-up, \"Blues Brothers 2000,\" portraying \"The Colonel\" in the Blues Brothers band. In real life, he toured with them.\n\nSponsor Message\n\nHe was inducted into the Songwriters Hall of Fame in 2005, and two years later received a Grammy Award for lifetime achievement.\n\nCropper continued recording into his later years, including 2024's \"Friendlytown,\" which was nominated for a Grammy. Earlier this year, Cropper received the Tennessee Governor's Arts Award, the state's highest honor in the arts.\n\n"
    },
    {
        "title": "Trump announces plans to weaken fuel efficiency rules for cars and trucks - The Washington Post",
        "url": "https://www.washingtonpost.com/climate-environment/2025/12/03/fuel-efficiency-rules-rollback/",
        "published_at": "2025-12-04T01:17:09Z",
        "source": "The Washington Post",
        "body": "President Donald Trump announced the rollback of fuel efficiency and tailpipe emission rules for cars and trucks at a White House event attended by executives from the country’s biggest automakers Wednesday. Under rules set by President Joe Biden, new cars sold in the United States would need to get more than 50 miles per gallon on average in 2031, effectively requiring automakers to sell more electric vehicles to meet the standard. The proposed rule change would lower that figure to 34.5 miles per gallon. Last year, new vehicles got about 28 miles per gallon on average, according to federal estimates.\n\nTrump also said his administration will “cancel” Environmental Protection Agency rules that limited greenhouse gas pollution from vehicles’ tailpipes. Turning to Ford CEO Jim Farley, Trump added, “Your people at Ford were coming to me all the time” to lobby for weaker rules.\n\n“These rules are going to allow the automakers to make vehicles that Americans want to purchase, not vehicles that Joe Biden and [former transportation secretary Pete] Buttigieg want them to build,” Transportation Secretary Sean P. Duffy said.\n\nLawmakers and executives from General Motors, Ford and Stellantis were at the White House to mark the announcement. Trump called on them one by one to praise his decision.\n\n“Today is a victory for common sense and affordability,” Farley said while standing over Trump’s shoulder, adding, “We believe that people should be able to make a choice, as you said, Mr. President, and we will invest more in affordable vehicles.”\n\nTrump’s signature second-term legislation, the One Big Beautiful Bill Act, eliminated financial penalties for car companies that fail to meet corporate average fuel economy (CAFE) standards, created by Congress in 1975 and strengthened over the years.\n\nAlthough automakers can already ignore the rules without penalty, officially rolling back the standards makes it harder for a future administration to reinstate them, according to Dan Becker, director of the Safe Climate Transport Campaign at the environmental nonprofit Center for Biological Diversity.\n\nWith weaker rules, car companies will “make more gas guzzlers that guzzle oil and produce a lot of pollution and cost consumers more at the gas pump,” Becker said.\n\nTrump signed a separate law in June to block California from enforcing a ban on new gas-powered car sales in 2035. Congress and the administration have also ended federal tax credits for EVs and pulled funding for building EVs and batteries.\n\nThose policy changes have prompted car companies to walk back their commitments to sell more EVs, canceling planned factories and laying off workers. Analysts have slashed their predictions for future EV sales and raised their projections for greenhouse gas pollution. General Motors, which once vowed to only sell EVs by 2035, has shifted billions of dollars of planned investments from electric to gas-powered cars.\n\nFederal fuel rules have ping-ponged from stricter to weaker standards as the White House has changed hands.\n\nThe back-and-forth policy changes have put U.S. automakers in a difficult position, according to Rich Gold, a lobbyist who heads the public policy and regulation group at Holland & Knight.\n\n“What the industry really needs is to be able to plan for a decade,” Gold said. “The auto industry doesn’t deal well with disruption and uncertainty. The infrastructure to build cars and get them to where they need to go takes a long time to build out.”\n\nEven so, Gold said, automakers are happier with Trump’s lax rules than they were with Biden’s strict standards, which he said would have been hard to achieve.\n\n“It’s a great day for us at Stellantis today, because it’s a day where we see CAFE regulation reconciled with real customers’ demand,” Stellantis CEO Antonio Filosa told Trump at the White House.\n\n“Today’s action is a win for American drivers,” American Petroleum Institute President Mike Sommers wrote in a statement. “We commend President Trump and Secretary Duffy for restoring commonsense fuel-economy standards that recognize the realities of today’s marketplace and the need to preserve affordable choices for families and businesses.”\n\nEnvironmentalists, meanwhile, lamented the latest blow to U.S. fuel economy rules."
    },
    {
        "title": "Investigation into pre-Budget leaks is under way, MPs told - BBC",
        "url": "https://www.bbc.com/news/articles/c4g9e7wp79zo",
        "published_at": "2025-12-04T00:12:53Z",
        "source": "BBC News",
        "body": "Investigation into pre-Budget leaks is under way, MPs told\n\n18 hours ago Share Save Josh Martin Business reporter Share Save\n\nReuters EV levies, tourist taxes, pension changes and income tax policy were announced in the Budget on 26 November, but were reported by media beforehand\n\nChancellor Rachel Reeves is backing an inquiry into pre-Budget leaks from the Treasury which knocked business and consumer confidence and moved markets. The chief secretary to the Treasury told the Commons on Wednesday an inquiry into pre-Budget leaks was under way, led by top Treasury civil servant James Bowler and had \"the full support of the chancellor\". Policies such as a freezing of income tax thresholds, a pay-per-mile levy on electric vehicles and a tourist tax were all reported in the lead-up to the Budget on 26 November. A downgrade of UK productivity from the Office for Budget Responsibility, and a plan to raise income tax rates, later abandoned, were also briefed to media.\n\nSpeaker Sir Lindsay Hoyle criticised the leaks, branding it the \"hokey-cokey Budget,\" and reminded the government that policy should be announced first to the Commons. James Murray, chief secretary to the Treasury, told the Commons: \"The government puts the utmost weight on Budget security, including prevention of leaks of information. \"A leak inquiry is now under way with the full support of the chancellor and the whole Treasury team.\" Mr Bowler would investigate the \"security processes to inform future fiscal events\", Mr Murray said. The Chair of the Treasury Select Committee, Dame Meg Hillier MP, said: \"Leak inquiries have a habit of not finding someone responsible. But if somebody is found responsible, will they follow the lead set by Richard Hughes [and resign]?\" Mr Murray responded saying he would \"not speculate on the outcome of the leak inquiry\". Mr Hughes was chairman of the Office for Budget Responsibility (OBR) before he resigned on Monday following a Budget day error which saw a key document published before the chancellor delivered her speech. The OBR's early publication effectively confirmed a number of new Budget measures before the chancellor announced them.\n\nThe Financial Conduct Authority (FCA) has requested details of the leak inquiry, after MPs called on the watchdog to investigate how Budget information was handled ahead of 26 November. In a letter to the Treasury Select Committee, the FCA's chief executive Nikhil Rathi said the financial regulator did not normally provide information about its inquiries but said it had requested information about the leak inquiry \"so we can consider as appropriate\".\n\n'Unhelpful' speculation\n\nThe steady flow of headlines around taxation and forecasts for the economy also influenced the bond markets, which dictates the interest rates the UK pays on its debt. A pre-Budget survey by Barclays pointed to more than half of business leaders saying they had delayed investment decisions until after the two-month lead-up to the Budget. \"Hundreds of thousands\" of people drew down part of their pension savings prematurely ahead of this Budget and the previous one because they were worried about what might be in it, the boss of one of the UK's biggest pension providers told Radio 4's Today programme. Mark FitzPatrick, chief executive of the FTSE 100 wealth manager St James's Place, said: \"The run-up to the Budget this time...there was a lot of speculation...and people act on speculation. \"The flying of kites is unhelpful when it affects people's lives.\""
    },
    {
        "title": "How Minnesota became a hub for Somali immigrants in the U.S. - NPR",
        "url": "https://www.npr.org/2025/12/03/nx-s1-5631809/somali-immigrants-minnesota-twin-cities-trump-ilhan-omar",
        "published_at": "2025-12-03T23:56:26Z",
        "source": "NPR",
        "body": "How Minnesota became a hub for Somali immigrants in the U.S.\n\ntoggle caption Jessie Wardarski/AP\n\nMinnesota boasts the largest population of Somalis in the U.S. — a community that's recently faced attacks from President Trump.\n\nOn Tuesday, Trump called Somali immigrants \"garbage\" and said he wanted to send them \"back to where they came from.\" He continued on Wednesday, saying, \"they've destroyed our country and all they do is complain, complain, complain.\"\n\nThe tirade came less than two weeks after Trump threatened to strip temporary legal protections from Somali migrants living in Minnesota.\n\nSponsor Message\n\nTrump and other conservatives have also recently seized on criminal investigations and news reports of fraud in Minnesota's social services system — some of which was allegedly committed by Somalis — to disparage the entire community.\n\nNow, U.S. Immigration and Customs Enforcement plans to target Minnesota and its Somali population in an upcoming immigration enforcement operation, The Associated Press and other outlets reported this week.\n\nNearly 80,000 people of Somali descent currently live in Minnesota, roughly 78% of whom reside in the Twin Cities, according to the St. Paul-based group Wilder Research.\n\nBut it didn't begin with the Twin Cities. Rather, some of the first Somali immigrants to enter the U.S. in the late 1990s came to a town called Marshall, about 150 miles west of Minneapolis, according to Minnesota author Ahmed Ismail Yusuf, who wrote the book Somalis in Minnesota.\n\nSomalia at the time was gripped by a civil war that caused hundreds of thousands of people to flee the country located in the Horn of Africa, and some of those who came to the U.S. found work at a Marshall meat-packing plant. As word got out about work opportunities in Marshall, other Somali refugees arrived in the region and got jobs in the hospitality industry, as taxi drivers and more, Yusuf said, forming a sizable Somali community in and around the Twin Cities.\n\n\"Those people who were hired, they brought their families. And when they brought their families with them, their families of course brought their children with them,\" he said.\n\nThe Somali refugees who settled in Minneapolis and St. Paul were also attracted by the fact that Minnesota was known for martisoor, which translates to \"hospitality\" in Somali. Yusuf said the state's \"liberal attitude and social behavior\" mirrored the immigrants' own values.\n\nFor some Somali refugees, the transition to living in Minnesota hasn't been entirely smooth. Some religious Somalis have faced barriers in practicing their Islamic faith, which can involve praying multiple times per day and the wearing of a hijab for Muslim women, according to the Minnesota Historical Society.\n\nThe society said the Somali population has also struggled to overcome its association with Islamic extremism, after the community became a recruiting target for ISIS over a decade ago.\n\nStill, Yusuf said the Somali population has continued to grow in Minnesota and find ways to give back. \"Right now, wherever you go, still we're serving the people, we are serving the community, we are serving the state,\" he said.\n\nMinnesota Democratic Rep. Ilhan Omar, who fled Somalia as a child and came to the U.S. as a refugee, in 2018 became the first Somali American elected to Congress.\n\nSponsor Message\n\nTrump said on Wednesday that Omar \"shouldn't be allowed to be a congresswoman, and I'm sure people are looking at that. And she should be thrown the hell out of our country.\"\n\nOmar told NPR on Wednesday that Trump's words about Somalis were \"vile\" and said it was not surprising because he has \"trafficked in racism, in xenophobia, in bigotry, in Islamophobia for as long as he has held office.\"\n\nShe said in a Tuesday social media post in response to Trump's earlier comments: \"His obsession with me is creepy. I hope he gets the help he desperately needs.\"\n\nShe was one of four congresswomen who Trump said in a 2019 tweet should \"go back and help fix the totally broken and crime infested places from which they came.\" At a rally shortly after his tweet about Omar, Trump paused while some members of the crowd chanted: \"Send her back.\"\n\nYusuf said the Somali community is now \"a bit under siege\" by the Trump administration, but he noted that it also has the support of city leaders in the Twin Cities, including Minneapolis Mayor Jacob Frey and St. Paul Mayor Melvin Carter.\n\n\"We are dealing with this,\" Yusuf said, \"but we are not dealing with it alone.\""
    },
    {
        "title": "Meta poaches Apple design exec Alan Dye to lead new creative studio in Reality Labs - TechCrunch",
        "url": "https://techcrunch.com/2025/12/03/meta-poaches-apple-design-exec-alan-dye-to-lead-new-creative-studio-in-reality-labs/",
        "published_at": "2025-12-03T23:37:26Z",
        "source": "TechCrunch",
        "body": "Alan Dye, the design executive who led Apple’s user interface team for the last decade, is leaving the company to join Meta, according to a report from Bloomberg’s Mark Gurman.\n\nThis is a significant hire for Meta, as the company makes a push toward consumer devices like smart glasses and virtual reality headsets. Dye will focus on improving AI features in these devices and report directly to Chief Technology Officer Andrew Bosworth.\n\nAt Apple, Dye will be replaced by Steve Lemay, who has had “a key role in the design of every major Apple interface since 1999,” according to a statement Apple CEO Tim Cook gave Bloomberg.\n\nIt seems that Meta is recruiting from its competitors to help the company compete in the AI race, as Meta also poached researchers from OpenAI this summer. (Allegedly, Meta CEO Mark Zuckerberg hand-delivered homemade soup to an OpenAI employee in a recruitment push; OpenAI chief research officer Mark Chen said that he has since delivered his own soup to promising Meta recruits.)\n\nShortly after the news broke of Dye’s departure, Zuckerberg announced a new creative studio within Reality Labs that would be led by Dye. There, he’ll be joined by Billy Sorrentino, another former Apple designer who led interface design across Reality Labs; Joshua To, who led interface design across Reality Labs; Meta’s industrial design team, led by Pete Bristol; and its metaverse design and art teams led by Jason Rubin.\n\nZuckerberg said the studio would “bring together design, fashion, and technology to define the next generation of our products and experiences.”\n\n“Our idea is to treat intelligence as a new design material and imagine what becomes possible when it is abundant, capable, and human-centered,” the Meta CEO wrote on Threads. “We plan to elevate design within Meta, and pull together a talented group with a combination of craft, creative vision, systems thinking, and deep experience building iconic products that bridge hardware and software.”\n\nTechcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | WAITLIST NOW\n\nThis article was updated after publication with additional information about Meta’s plans."
    },
    {
        "title": "Miley Cyrus confirms engagement to musician Maxx Morando - BBC",
        "url": "https://www.bbc.com/news/articles/cwypwxprjd4o",
        "published_at": "2025-12-03T23:24:33Z",
        "source": "BBC News",
        "body": "Miley Cyrus confirms engagement to musician Maxx Morando\n\n\"I am not easy to surprise because I love to control every situation and I had completely surrendered and I'm telling you, I was so, so, so surprised,\" she said.\n\nIn an interview with US TV show Good Morning America on Wednesday, the 33-year-old said Morando had got down on one knee for the proposal during a recent trip to Asia.\n\nThe three-time Grammy winner was seen wearing a gold and diamond ring on her engagement finger at the premiere of Avatar: Fire and Ash in Los Angeles on Monday.\n\nMiley Cyrus has confirmed her engagement to her partner of four years, musician Maxx Morando.\n\nCyrus, whose hits include Flowers and Party in the U.S.A, previously married Australian actor Liam Hemsworth in 2018.\n\nThe couple had been in a relationship for a decade but announced their divorce in 2019.\n\nSpeaking to British Vogue in 2023, Cyrus said she and 27-year-old Morando met after being \"put on a blind date\".\n\nMorando is a drummer with LA-based band Liily. The band participated in NBC's Miley's New Year's Eve Party - hosted by Cyrus - in 2022, alongside musicians including Cyrus's godmother Dolly Parton and David Byrne.\n\nHolding up her ring, Cyrus told Good Morning America that Morando \"did good\" with the choice.\n\n\"Me and Max have been together for four years and it's very obvious the drastic amount of growth that I've had in those four years,\" she said.\n\n\"You want to have someone by your side that always tells you you can do it.\"\n\nThe pop star's latest song, Dream as One, is featured in the latest Avatar instalment.\n\nShe released her ninth album earlier this year but has said she has \"no desire\" to go on tour, saying she is put off by how hard it is to maintain sobriety and her mental health while on the road."
    },
    {
        "title": "Admins and defenders gird themselves against maximum-severity server vuln - Ars Technica",
        "url": "https://arstechnica.com/security/2025/12/admins-and-defenders-gird-themselves-against-maximum-severity-server-vulnerability/",
        "published_at": "2025-12-03T23:16:03Z",
        "source": "Ars Technica",
        "body": "Security defenders are girding themselves in response to the disclosure of a maximum-severity vulnerability disclosed Wednesday in React Server, an open-source package that’s widely used by websites and in cloud environments.\n\nThe vulnerability is easy to exploit and allows hackers to execute malicious code on servers that run it. Exploit code is now publicly available.\n\nReact is embedded into web apps running on servers so that remote devices render JavaScript and content more quickly and with fewer resources required. React is used by an estimated 6 percent of all websites and 39 percent of cloud environments. When end users reload a page, React allows servers to re-render only parts that have changed, a feature that drastically speeds up performance and lowers the computing resources required by the server.\n\nA perfect 10\n\nSecurity firm Wiz said exploitation requires only a single HTTP request and had a “near-100% reliability” in its testing. Multiple software frameworks and libraries embed React implementations by default. As a result, even when apps don’t explicitly make use of React functionality, they can still be vulnerable, since the integration layer itself invokes the buggy code.\n\nThe combination of the widespread use of React—particularly in cloud environments—the ease of exploitation, and the ability to execute code that gives attackers control of servers has earned the vulnerability a severity rating of 10, the highest score possible. On social media, security defenders and software engineers urged anyone responsible for React-related apps to immediately install an update released Wednesday."
    },
    {
        "title": "Mississippi AD, players and state official say Kiffin's account about his departure is inaccurate - AP News",
        "url": "https://apnews.com/article/mississippi-ole-miss-lane-kiffin-33093cbb28f70fb2a0efa4e28dc2dc0e",
        "published_at": "2025-12-03T22:32:00Z",
        "source": "Associated Press",
        "body": "Add AP News as your preferred source to see more of our stories on Google.\n\nAdd AP News on Google Add AP News as your preferred source to see more of our stories on Google. Share\n\n▶ Get the AP Top 25 college football poll delivered straight to your inbox every week with AP Top 25 Poll Alerts. Sign up here.\n\nMississippi athletic director Keith Carter, members of the football team and even the state’s top public safety officer are challenging the veracity of Lane Kiffin’s portrayal of the events surrounding his departure for LSU.\n\n“There’s been a lot of things he said publicly that I’m not sure are totally accurate,” Carter said Wednesday during an appearance on a Mississippi talk show.\n\nLSU announced the hiring of Kiffin on Sunday, two days after Mississippi defeated Mississippi State in the Egg Bowl to finish the regular season 11-1. Rebels defensive coordinator Pete Golding was named head coach shortly after Kiffin’s hiring at LSU became official.\n\nKiffin posted a farewell message on X saying he had hoped to coach the Rebels through the College Football Playoff and that the players wanted him to stay through the postseason. The team is No. 6 in this week’s CFP rankings, making it a near lock to receive an at-large bid.\n\n“My request to do so was denied by Keith Carter despite the team also asking him to allow me to keep coaching them so they could better maintain their high level of performance,” Kiffin wrote.\n\nKiffin had said he was under the impression he would be able to coach the Rebels in the CFP until he was told otherwise in a meeting early Sunday, according to Yahoo Sports.\n\nThink you know who belongs in the Top 25? Now it’s your turn to vote with the AP Top 25 fan poll.\n\nSpeaking on “Mornings With Richard Cross” on SuperTalk Mississippi, Carter said Kiffin and his representatives had been told several weeks ago that he would not coach in the playoff if he was not staying at Mississippi.\n\n“I see him finding out at 8:30 on Sunday morning for the very first time that he would not be coaching the playoff is not accurate,” Carter said.\n\nAs for the players asking him to stay through the playoff, offensive lineman Brycen Sanders wrote on X: “I think everyone that was in that room would disagree.”\n\nCarter said “there was a lot of pushback to him leaving” because the players were concerned about who would coach them.\n\n“And it was sounding like he was going to take all the offensive staff with him,” Carter said. “So there was a lot of discussion around that. But I think begging for him to stay is certainly an overstatement.”\n\nLinebacker Suntarine Perkins wrote on X that Kiffin’s social media post on Sunday did not match what he said in the meeting with players. “Everybody that was in there can vouch on this,” Perkins said.\n\nKiffin also said a Mississippi fan tried to run him off the road as he was driving to the airport for his flight to Baton Rouge, Louisiana, on Sunday. The Mississippi Highway Patrol escorted Kiffin to the airport and reported no incidents.\n\nIn a satirical video posted on Mississippi DPS social platforms, commissioner Sean Tindell, walking a dog and wearing a visor in a nod to Kiffin, said, “Contrary to any rumor or any other allegations, there’s been no incidents where our highway patrol state troopers were involved in any sort of accident trying to run coach Kiffin off the road when he was leaving Oxford last weekend. He had a safe trip and he’s on his way.”\n\n___\n\nGet poll alerts and updates on the AP Top 25 throughout the season. Sign up here and here (AP News mobile app). AP college football: https://apnews.com/hub/ap-top-25-college-football-poll and https://apnews.com/hub/college-football"
    },
    {
        "title": "Satellites keep photobombing the Hubble telescope, and it’s getting worse - The Verge",
        "url": "https://www.theverge.com/news/837652/hubble-telescope-satellite-light-pollution",
        "published_at": "2025-12-03T22:05:46Z",
        "source": "The Verge",
        "body": "is a senior science reporter covering energy and the environment with more than a decade of experience. She is also the host of Hell or High Water: When Disaster Hits Home , a podcast from Vox Media and Audible Originals.\n\nIt’s getting harder and harder for the Hubble and other telescopes orbiting Earth to capture pristine images thanks to the sudden surge in satellite launches. Satellite trails could mess up nearly 40 percent of images the Hubble takes and up to 96 percent of those taken by three other telescopes over the next decade, according to a study by NASA researchers published today in the journal Nature.\n\nThat could jeopardize scientists’ ability to spot worrisome asteroids or discover new planets, they warn. Our view of space just gets fuzzier without efforts to limit light pollution from new megaconstellations of satellites.\n\nThe scale of the problem is astounding\n\n“My career has been focused on trying to make telescopes see better … try to make the telescopes more sensitive, more precise, getting better images,” says Alejandro Borlaff, a NASA research scientist and lead author of the study. “For the first time, we found something that may actually be worse in the future.”\n\nThe scale of the problem is astounding. Cheaper launch costs and the proliferation of telecommunications satellites like Starlink’s have opened up a Pandora’s box of new challenges in space. Satellite trails, which look like streaks of light, were already detected in 4.3 percent of images taken by the Hubble between 2018 and 2021. The number of satellites orbiting Earth has grown from 5,000 in 2019 to more than 15,800 today, according to the European Space Agency. That number could reach as high as 560,000 if currently planned satellite launches proceed over the next 10 years or so.\n\nBorlaff and his colleagues simulated the view that four telescopes are likely to have after all those launches. With that much crowding in space, they project that the Hubble telescope could inadvertently capture an average of 2.14 satellites per exposure. The Chinese Space Station Telescope Xuntian, one of the other telescopes included in the study that’s expected to launch next year, could see an average of 92 satellites per exposure. The Hubble is less likely to catch as many satellites in its images because of its narrower field of view. Fortunately, other powerful telescopes, including the James Webb, orbit far enough from Earth to avoid light contamination from satellites.\n\nThe issue goes beyond accidentally including a satellite (or many) among the visions of swirling nebulae, stars, and distant planets these telescopes capture. The satellites reflect light from the Sun, Moon, or Earth, which can be bright enough to obscure details that might otherwise be captured in an image were it not for that light pollution. Researchers might not be able to detect a change in the brightness of a star that could indicate that there’s an exoplanet there, Borlaff explains. “You will lose that information because a satellite passed in front of you.”\n\nNow’s the time to find solutions, he says, before there are so many satellites in orbit. Efforts to design darker, less reflective satellites have posed new problems because they tend to get hotter and shed more infrared light as a result. Researchers have also tried strategizing to take images at times and locations with a lower likelihood of satellites crossing their path, an endeavor that’s harder to do the more crowded it gets out there. It’ll take more coordination on the ground with companies and governments launching satellites, maybe by placing them in orbit lower than where the telescopes are to avoid obstructing their view or regulating where they can be deployed.\n\n“There has to be an optimal way to place constellations and space telescopes … so we can coexist in a sustainable way,” Borlaff says."
    },
    {
        "title": "A new tiara for Kate! The Princess of Wales makes a dazzling debut in a rare ruby and diamond tiara for the German state banquet - Tatler",
        "url": "https://www.tatler.com/article/kate-middleton-makes-her-dazzling-debut-in-a-show-stopping-tiara-for-the-german-state-banquet",
        "published_at": "2025-12-03T21:52:48Z",
        "source": "Tatler",
        "body": "Prince William and Kate Middleton at the German state banquet AARON CHOWN/Getty Images\n\nThe Princess of Wales looked resplendent in a rarely-seen royal tiara and glittering Jenny Packham gown as she joined husband Prince William at the German state banquet at Windsor Castle on Wednesday night.\n\nKate Middleton made her debut in the Queen Victoria Oriental Circlet Tiara, a treasure from the royal collection that was created by Garrard for Queen Victoria in 1853 under the direction of her beloved husband and consort, Prince Albert. The piece was beloved by Queen Elizabeth, the Queen Mother, but was only worn once by Queen Elizabeth II and has only been seen a handful of times in recent decades.\n\nIt proved the perfect finishing touch for her sparkling gown – a dazzling, ethereal creation by go-to designer Jenny Packham. The gown featured a dramatic slashed neckline, sequin skirt and elegant cape. Meanwhile, Prince William was dapper in white tie.\n\nRead More Kate Middleton pays tribute to Princess Diana with dazzling diamond and sapphire earrings for German state visit Accessorising her Alexander McQueen coat dress, Kate Middleton opted for a favourite pair of diamond and sapphire earrings\n\nKing Charles III and Queen Camilla and the Duke and Duchess of Edinburgh were also at their elegant best for the banquet, which was held at Windsor Castle while construction work continues at Buckingham Palace. The formal dinner is the centrepiece of a three-day state visit to the UK by the President and First Lady of Germany."
    },
    {
        "title": "Matthew Perry’s Doctor Sentenced to 30 Months for Supplying Ketamine - Variety",
        "url": "https://variety.com/2025/tv/news/matthew-perry-doctor-sentenced-30-months-ketamine-1236599122/",
        "published_at": "2025-12-03T21:13:00Z",
        "source": "Variety",
        "body": "Salvador Plasencia, the doctor who supplied ketamine to Matthew Perry in the weeks before his overdose death in 2023, was sentenced Wednesday to 30 months in federal prison.\n\nPlasencia apologized to Perry’s family before the sentence was read in a Los Angeles federal court, admitting he had violated his oath to care for the actor.\n\n“I failed Mr. Perry. I failed his family,” he said. “I should have protected him.”\n\nPlasencia pleaded guilty in July to four counts of ketamine distribution, though he did not provide the fatal dose. He was handcuffed and taken into custody by federal marshals.\n\nPopular on Variety\n\nProsecutors had asked for three years in prison, while the defense asked that he be sentenced to probation. Before issuing her sentence, Judge Sherilyn Peace Garnett rejected a defense argument that Plasencia initially intended to treat Perry’s depression.\n\n“I don’t find that rings true,” she said, saying the doctor had sought “to exploit Mr. Perry’s addiction for your own profit.”\n\nShe noted that Plasencia had obtained $55,000 during his brief relationship with Perry, and said that if the case involved any other controlled substance, “we’d be looking at a lot more time.”\n\nKaren Goldstein, Plasencia’s defense lawyer, acknowledged that his decisions were “clouded by money.”\n\n“It really was a perfect storm of bad decision-making,” she said.\n\nProsecutor Ian Yanniello, meanwhile, pushed back on attempts to minimize Plasencia’s conduct.\n\n“He wasn’t a negligent medical provider,” Yanniello said. “He was a drug dealer in a white coat.”\n\nIn text messages, Plasencia had discussed Perry’s request for ketamine, saying “I wonder how much this moron will pay.”\n\nPerry’s mother, Suzanne Morrison, addressed the doctor directly during her victim impact statement.\n\n“This is my boy,” she said. “I know how addicted he was. He survived it all… To be called a ‘moron’ — there’s nothing moronic about that man… This was a bad thing you did.”\n\nMadeline Morrison, Perry’s half-sister, also spoke about the family’s grief, and said that Plasencia had exploited Perry’s greatest fear and biggest weakness.\n\n“Celebrities are not just plastic dolls you can take advantage of,” she said. “They’re people.”\n\nFour other defendants who were also involved in Perry’s death have yet to be sentenced."
    },
    {
        "title": "Giannis Antetokounmpo reportedly meeting with Bucks front office about future with club - NBC Sports",
        "url": "https://www.nbcsports.com/nba/news/giannis-antetokounmpo-reportedly-meeting-with-bucks-front-office-about-future-with-club",
        "published_at": "2025-12-03T21:00:14Z",
        "source": "NBCSports.com",
        "body": "On Tuesday, Giannis Antetokounmpo scrubbed virtually all mentions of the Milwaukee Bucks from his social media — a troubling sign for a 9-13 team built around the two-time MVP.\n\nNow comes a report that Antetokounmpo and his agent are meeting with the Milwaukee Bucks to discuss “whether his best fit is staying or a move elsewhere,” Shams Charania reports at ESPN. The report adds that the sides are expected to reach a resolution “in the coming weeks,” which will impact whether Antetokounmpo is available around February’s NBA trade deadline.\n\nThis is far from the first time Antetokounmpo trade rumors have surfaced, even in the past year. He reportedly pushed the Bucks to discuss a trade with the New York Knicks during a few weeks last August, but those talks went nowhere.\n\nThat led to comments from Antetokounmpo at the team’s media day.\n\n“I’ve said this many times, I want to be in a situation that I can win and now I’m here,” Antetokounmpo said. “I believe in this team. I believe in my teammates. I’m here to lead this team to wherever we can go, and it’s definitely going to be hard ... Now, if in six, seven months, I change my mind, I think that’s human, too. You’re allowed to make any decision you want, but I’m locked in. I’m locked in to this team. I’m locked in to these guys, to this group and to this coaching staff and to myself.”\n\n“Six or seven months” implied Antetokounmpo would revisit the issue next offseason, a re-evaluation he says he makes every summer. However, the Bucks’ rough start may have changed his thinking and his timeline.\n\nAntetokounmpo is playing at an MVP level this season, averaging 30.6 points, 10.7 rebounds, and 6.4 assists a game. Milwaukee recently went 0-4 when Antetokounmpo was out with a groin strain, and the team is now 1-5 on the season when he does not play and just 8-8 when he does, including an ugly loss to the Wizards on Monday night. Milwaukee is not a contender as constructed, even in a wide-open East — that despite the expensive buyout of Damian Lillard last summer, creating room to pick up Myles Turner. Even if they want to make a big move, the Bucks don’t have the draft picks or young players it would likely take to make a trade that would dramatically upgrade the roster this season.\n\nThe Bucks are not going to trade Antetokounmpo unless he directly requests it. If he and his agent make that request, the first big question is this:\n\nWould the Bucks honor Antetokounmpo’s wishes and try to move him where he wants to go? (Presumably New York, but there could be other teams on that list.) Or, are they going to do what is best for the franchise and get the best possible return? Those are not the same thing.\n\nTrading Antetokounmpo and his $54.1 million salary during the season is incredibly challenging. Especially considering the teams he would want to be traded to — the Knicks, maybe the Warriors, others — are also hard-capped or up against the luxury tax aprons themselves.\n\nIf Milwaukee is forced to trade him, it will ask for a massive haul featuring a combination of an established young star and/or high-level prospect, high draft picks, and veteran contracts it can flip in a trade, all to jump-start the inevitable rebuild.\n\nIf the Bucks want the biggest haul, it makes it tough on teams such as the Knicks, for example. They are thin on quality young players and have only one first-round pick, plus a couple of swaps, to offer. The math works on a trade of Karl-Anthony Towns and Miles McBride plus the pick, but is that nearly enough for Milwaukee? What’s more, consider that there would be a long line of teams at least checking in — Houston, San Antonio, Atlanta, Orlando, and the list will go on and on — and some (many?) of those would put together offers more enticing to the Bucks.\n\nAll of that is getting ahead of things. For now, the Bucks and Antetokounmpo (as well as his agent, Alex Saratsis) are sitting down and figuring out what is next. Even if that is a decision to part ways, an offseason trade is far more likely than one at the deadline."
    },
    {
        "title": "CDC's vaccine advisers meet to question long-used vaccines - NPR",
        "url": "https://www.npr.org/sections/shots-health-news/2025/12/03/nx-s1-5630917/cdc-childhood-vaccine-schedule",
        "published_at": "2025-12-03T20:47:22Z",
        "source": "NPR",
        "body": "CDC's vaccine advisers are likely to make a controversial change to long-used vaccine\n\ntoggle caption Joe Raedle/Getty Images\n\nPowerful federal advisers this week are expected to make a controversial change to how babies are immunized against hepatitis B, and to question how pediatricians inoculate children against more than a dozen other infectious diseases, including measles, mumps, whooping cough and polio.\n\nThe Centers for Disease Control and Prevention's Advisory Committee on Immunization Practices, or ACIP, is convening Thursday and Friday for a closely watched meeting to rethink fundamental elements of the childhood vaccination schedule, which has protected children from dangerous diseases for decades.\n\nThe potential changes are welcomed by allies of Health and Human Services Secretary Robert F. Kennedy Jr., who has long questioned the safety and effectiveness of vaccines.\n\nSponsor Message\n\n\"We're now starting to see truth telling about vaccines, and needless to say, pharma, medicine, academia, mainstream media are not happy,\" Mary Holland of Children's Health Defense said in a video posted to the group's social media page. The nonprofit advocates against vaccines and was co-founded by Kennedy.\n\nThe meeting underscores grave concerns among many public health experts, who fear it will further erode childhood vaccinations, leading to a resurgence of preventable infectious diseases.\n\n\"We now seem to have entered a dangerous new phase in Secretary Kennedy's campaign to shut down scientific expertise, silence the best available evidence, and replace it with his own personal agenda,\" said Dr. Sean O'Leary, a professor of pediatric infectious diseases at the University of Colorado Anschutz who chairs the American Academy of Pediatrics's committee on infectious diseases.\n\nThe CDC's advisory committee, established in 1964, had long been considered a definitive source of information about childhood vaccines. It wields enormous power because its recommendations influence how doctors vaccinate patients and dictate whether insurance companies pay for shots.\n\nBut the committee has lost the trust of most mainstream medical groups since Kennedy replaced its members in June with his own slate. The committee has also abandoned longstanding collaborations with medical groups like the pediatrics academy and draws less on the experience of CDC experts.\n\nSponsor Message\n\nThe committee's September meeting devolved into chaos. A scheduled vote on the hepatitis B vaccine was tabled amid confusion. The chairman was replaced this week. The new chair, Dr. Kirk Milhoan, is a pediatric cardiologist and fellow with the Independent Medical Alliance — a group which continues to recommend treating COVID with drugs like ivermectin, even though studies have shown it does not work.\n\nConfidence in the CDC was further eroded last month when the agency changed its stance on whether vaccines may cause autism, a theory championed by Kennedy and other anti-vaccine activists but long debunked by a large body of high-quality research.\n\nIn response, many independent medical groups, such as the American Academy of Pediatrics, the American Academy of Family Physicians and a newly formed effort at the University of Minnesota called the Vaccine Integrity Project, have begun issuing independent recommendations, which some states have begun following instead.\n\nVaccine schedule under the microscope\n\nThe vaccine committee is expected to hear the first report by a new working group tasked with scrutinizing the childhood vaccine schedule. The schedule is the finely calibrated timetable pediatricians use to administer the sequence of more than 30 doses to protect against more than a dozen diseases.\n\nThe scrutiny is especially troubling to many public health authorities, coming amid new outbreaks of vaccine preventable diseases, which are on the rise because of falling immunization rates.\n\n\"We have seen more measles cases in our country this year than we have in recent history. In my own community, we're seeing quite significant upticks in pertussis,\" said Dr. Raynard Washington, director of the Mecklenburg County Public Health Department, based in Charlotte, N.C., \"Any barriers [to vaccination] that might be created by bureaucracy or process pose a threat to the public's health.\"\n\nVaccine proponents say every vaccine is carefully evaluated for safety and effectiveness before being added to the schedule. And researchers and regulators monitor all vaccines for safety issues after doctors start using them.\n\nSponsor Message\n\nChildren receive the roster of shots at a young age to make sure they don't catch dangerous diseases when they're most vulnerable, experts say.\n\n\"Every vaccine on that schedule and the recommended timing of it exists for a reason,\" says pediatrician O'Leary. \"It's based on the age at which a child's immune system can provide optimal protection after vaccination, balanced with the age when the child is at highest risk for a disease. There's no reason to delay or space out vaccines – doing so just puts children at risk.\"\n\nSome who are worried about vaccines argue the number of different antigens and other ingredients could overwhelm a child's immune system. But supporters say children are exposed to far more immune stimulation from naturally occurring microbes than from vaccines. And vaccines have been refined over the decades to minimize the number of ingredients they contain.\n\n\"Imagine saying we can only use medicines now that were developed before 1990,\" O'Leary says. \"Imagine where we would be in medicine today. These newer vaccines are a good thing. They save lives. That's why we give them.\"\n\nA change for the hepatitis B vaccine\n\nThe first concrete step expected from the committee is a vote to change the current recommendation that all babies get vaccinated against hepatitis B within the first 24 hours of life.\n\nThe committee will consider recommending the shot only for babies whose mothers test positive for hepatitis B and recommending individual decision-making for babies born to mothers who test negative, according to the vote language posted Friday. The committee will also consider whether to recommend that babies who do get vaccinated get a blood test before getting the second and third shots typically given to provide full protection.\n\nProponents of the change argue universal vaccination at birth is unnecessary because hepatitis B is often spread through sexual contact and drug use. Babies could be protected by increased screening of pregnant women and only inoculating babies of mothers who test positive, some argue. Supporters of the change also point to other countries that don't give newborns the dose.\n\nBut hepatitis B spreads other ways. The virus is highly infectious, and can be transmitted through contact with an infected person's body fluids, such as their blood. People can also get infected by coming into contact with common household objects, such as toothbrushes, and towels, that have been contaminated by another family member.\n\nA new analysis by researchers with the Vaccine Integrity Project finds that restricting the birth dose to infants whose mothers test positive for hepatitis B could raise cases in babies by up to 76%.\n\nSponsor Message\n\nMost babies infected with the virus end up with chronic infections, which increases their risk for liver disease, failure and cancer.\n\n\"Universal vaccination has been the cornerstone of hepatitis B elimination efforts for decades,\" says Eric Hall, assistant professor of epidemiology at Oregon Health and Science University. \"It's very important we continue this work and do not undo the important public health achievements of the past 45 years.\"\n\nInoculating all babies at birth has resulted in a dramatic decrease in hepatitis B infections.\n\n\"The hepatitis B vaccine has one of the most well-established safety records of any vaccine, and it's one of our best,\" O'Leary says. \"We've been using it for a long time. It's one of our best tools to protect babies from chronic illness and liver cancer. This is a situation where one missed case is too many.\"\n\nHe added that pediatricians partner with parents on children's health. \"You probably will also hear a lot from individuals in this meeting who claim parents don't get a say in their children's immunizations,\" he said. \"I want to be very clear when I say that's completely false. … We want to make sure we're protecting children from harmful diseases while also making sure the parents are fully informed and involved in the process.\"\n\nIn addition, proponents of universal hepatitis B vaccination at birth argue there is no evidence the current approach is unsafe. And delaying the first dose would cause major problems because the subsequent two doses are administered as part of combination vaccines.\n\nExperts are also alarmed that the CDC is investigating splitting up the MMR vaccine, which protects kids against measles, mumps and rubella in one shot. Giving kids three separate shots would mean more trips to the doctor and more needles, vaccine proponents say. They worry that, inevitably, more kids would end up missing vaccines.\n\nSponsor Message\n\nAluminum ingredients under fire\n\nThe committee is also studying the safety of an ingredient commonly used in vaccines, an additive that contains aluminum. Coming after other recent changes to vaccine policy, many public health experts worry that the administration may now try to remove the ingredient.\n\nFor almost a century, some important vaccines, including shots that protect against diphtheria, tetanus, hepatitis and the flu, have included aluminum salts, compounds that contain small amounts of aluminum. They are used as adjuvants to give the immune system an extra boost to make the shots protective.\n\n\"What aluminum does is it draws the immune system's attention to that particular little protein so that it makes a much more robust immune response that you then are protected by,\" O'Leary says.\n\nOne question the working group is considering is \"do either of the two different aluminum adjuvants increase the risk of asthma?\" according to a document outlining the group's mandate.\n\nMost public health experts say there's no good evidence that aluminum adjuvants are unsafe and ample evidence that they pose no real concern. In fact, a large Danish study recently debunked any danger. People are exposed to far more aluminum on a daily basis from food, consumer products and their surrounding environment than from vaccines.\n\nIn addition to concerns over asthma, critics claim aluminum can also increase the risk for other health problems, including autism and attention deficit hyperactivity disorder.\n\n\"Based on large, long-term studies and immunology research, there is no evidence that vaccines cause either allergies or autoimmune disorders e.g., Type 1 diabetes, rheumatoid arthritis, multiple sclerosis, systemic lupus,\" Dr. Frank Virant, president of the Board of Directors at the American Academy of Allergy, Asthma & Immunology, wrote in an email to NPR.\n\nBut removing aluminum from vaccines would render them ineffective, and there are no substitute vaccines ready to go. It could take years to develop reformulated replacements."
    },
    {
        "title": "Surprising link found between a popular vaccine and lower dementia risk - Earth.com",
        "url": "https://www.earth.com/news/surprising-link-between-shingles-vaccine-and-lower-dementia-risk/",
        "published_at": "2025-12-03T19:36:57Z",
        "source": "Earth.com",
        "body": "Public-health decisions sometimes create natural experiments that reveal things no lab could plan. The country of Wales unintentionally produced one of those moments when a routine shingles vaccine – given only to people hitting a very narrow age window – appeared to protect long-term memory.\n\nThe unexpected pattern caught the attention of Stanford Medicine researchers, who combed through years of medical records and found something striking.\n\nA follow-up study deepened the story, pointing toward viral reactivation, immune aging, and neuroinflammation as powerful – and often overlooked – forces in cognitive decline.\n\nTogether, the findings suggest that a simple shingles shot may do far more for the aging brain than anyone expected.\n\nWhen dormant viruses awaken\n\nVaricella-zoster remains silent in nerve cells after childhood infection. Reactivation risk rises with age. Dementia research once focused on plaques and tangles alone.\n\nNew work highlights neuroinflammation as a major driver. Neurotropic herpesviruses can seed amyloid in mice.\n\nHuman organoid work links viral activity with tau changes. Chronic viral stress may push immune pathways into harmful patterns. Reactivation pulses may degrade cognitive reserve over many years.\n\nWales introduced a live shingles vaccine with strict age rules. Only individuals aged exactly 79 in early autumn gained access for one year. Individuals just older lost access permanently.\n\nThis narrow gap created two nearly identical groups. Corresponding author Pascal Geldsetzer explained a key concern.\n\n“All these associational studies suffer from the basic problem that people who go get vaccinated have different health behaviors than those who don’t,” he said. The Welsh plan solved that concern through pure timing.\n\nDementia and the shingles vaccine\n\nStanford Medicine tracked outcomes across seven years. Vaccinated individuals showed a 20 percent lower rate of dementia. A Cell paper expanded that pattern. Mild cognitive impairment fell in the vaccinated group.\n\nDementia-related deaths also dropped across nearly a decade. Evidence pointed to protection across the full disease path. Regression methods reduced confounding risk.\n\nNo other intervention aligned with the exact birthdate rule. Consistent outcomes supported a causal interpretation.\n\nMild cognitive impairment signals early trouble in memory networks. The Cell study followed over 200,000 new cases. Vaccine eligibility lowered new diagnoses over a nine-year window.\n\nActual vaccine receipt lowered risk even more. Analyses held firm across many statistical checks. The age difference was only a few days, yet protection remained clear.\n\nViral mechanisms likely shaped this early stage through reduced reactivation events. Reduced immune stress may preserve neural circuits in vulnerable regions.\n\nVaccine slowed dementia\n\nA second group included individuals already living with dementia. Nearly half died from dementia causes over nine years.\n\nVaccinated individuals showed far fewer dementia-related deaths. Actual vaccine receipt dropped that risk by nearly one-third. Evidence again pointed to broad protection.\n\n“The most exciting part is that the shingles vaccine doesn’t have only preventive, delaying benefits for dementia, but also therapeutic potential for those who already have dementia,” Geldsetzer said. Survival gains hinted at reduced inflammatory pressure in advanced disease.\n\nWomen gained stronger protection in both early and late stages. Women often mount higher antibody responses after live vaccines. Varicella-zoster reactivation also appears more common in women.\n\nThese factors may amplify vaccine impact on immune tone. Cognitive decline risk falls as immune stability rises. Women showed reductions in mild cognitive impairment and dementia-related deaths.\n\nMen did not show clear shifts in either stage. Sex-linked immune biology may hold crucial clues for future work.\n\nPreventing dementia with shingles vaccine\n\nNew work explores immune pathways independent of viral action. Some vaccines boost innate pathways in older age. Such boosts may counter immunosenescence.\n\nLive vaccines often produce broad health gains unrelated to direct targets. Some work links vaccination with stronger long term immune balance. Reduced chronic inflammation may protect neural circuits across many decades.\n\nNew theory suggests cumulative viral reactivations erode cognitive resilience. Shingles vaccination may interrupt harmful cycles early.\n\nSimilar age-based rollouts in Australia and several other countries now show matching results. Records from England, New Zealand, and Canada echo the Welsh pattern.\n\nGains appear stable across cultures, health systems, and demographics. “We just keep seeing this strong protective signal for dementia in dataset after dataset,” Geldsetzer said.\n\nSuch uniformity strengthens confidence in causal action. International teams now explore additional immune markers.\n\nDementia lessons from shingles\n\nA randomized trial could confirm these findings with full certainty. Geldsetzer called it simple. “It would be a very simple, pragmatic trial because we have a one-off intervention that we know is safe,” he said. Wales showed curve separation within one to two years.\n\nA trial may reveal early signals without long waits. Newer shingles vaccines may offer even stronger impact. Philanthropic support now aims to launch such work soon.\n\nThe work suggests a single shot may slow decline across many stages of dementia. Public health systems rarely create natural experiments of such clarity.\n\nThe nation of Wales offered one such moment. Research now points toward practical potential for brain health in older age.\n\nThe study is published in the journal Cell.\n\n—–\n\nLike what you read? Subscribe to our newsletter for engaging articles, exclusive content, and the latest updates.\n\nCheck us out on EarthSnap, a free app brought to you by Eric Ralls and Earth.com.\n\n—–"
    },
    {
        "title": "\"Space gum\" and sugars discovered in asteroid Bennu samples, NASA reveals - CBS News",
        "url": "https://www.cbsnews.com/news/space-gum-sugars-asteroid-bennu-samples-nasa-reveals/",
        "published_at": "2025-12-03T19:20:00Z",
        "source": "CBS News",
        "body": "Samples taken from the asteroid Bennu are continuing to shed light on the origins of the solar system.\n\nScientists have been studying the samples since NASA's Osiris-REx spacecraft carried them back to Earth in 2020 and recently discovered that that they contain sugars and \"a gum-like substance not seen before in astromaterials,\" NASA said.\n\nThe revelations — and how they can help answer big questions about the beginnings of life — are described in three new papers published Tuesday by the journals Nature Geosciences and Nature Astronomy.\n\nAn artistic visualization of the OSIRIS-REx spacecraft descending towards asteroid Bennu to collect a sample. NASA/Goddard/University of Arizona\n\nIn the first paper, scientists led by Yoshihiro Furukawa of Japan's Tohoku University focus on sugars uncovered in the asteroid samples, which are characterized as essential building blocks for biology on Earth. The second, by Scott Sandford at NASA's Ames Research Center and Zack Gainsforth of the University of California at Berkeley, reveals that the ancient \"space gum\" also present in the samples could have played a foundational role in catalyzing early life on our planet.\n\nThe third paper, led by Ann Nguyen of NASA's Johnson Space Center, analyzed dust from two different types of rock that Osiris-REx collected from Bennu, which initially came from stars that predate the solar system.\n\nIngredients for existence\n\nEach of the three papers zeroes in on a clue from the Bennu asteroid as to how the solar system developed and how life on Earth eventually came to be.\n\nThe sugars discovered in the asteroid samples, along with other molecules like amino acids previously detected in them, do not necessarily provide evidence of life, NASA said. But they do show that fundamental elements of the compounds that make up living organisms and allow biological processes to happen within individual cells were, at least at one time, widespread throughout the solar system. Some of the basic molecules used to construct DNA — and RNA, a vital messenger that codes and decodes genetic information — were found in the samples from Bennu, researchers said.\n\nFurukawa said the sugars found in the Bennu samples support a hypothesis about the survival mechanisms used by the first forms of earthly life, which may have relied primarily on the messenger molecule rather than the complicated biological processes that ground it today.\n\n\"Present day life is based on a complex system,\" he said. \"However, early life may have been simpler.\"\n\nThe mysterious \"space gum\" never seen in cosmic rocks before its discovery in the Bennu samples likely formed in the solar system's infancy, NASA said. According to the agency, the molecules it contains \"could have provided some of the chemical precursors that helped trigger life on Earth.\"\n\nThe gum is an important piece of the puzzle for scientists studying how life on the planet began and whether it exists elsewhere.\n\n\"With this strange substance, we're looking at, quite possibly, one of the earliest alterations of materials that occurred in this rock,\" said Sandford, who co-led the paper on Bennu's surprising gum. \"On this primitive asteroid that formed in the early days of the solar system, we're looking at events near the beginning of the beginning.\"\n\nSome of the new research also examines the formation of Bennu itself, which, like other asteroids in the solar system, is a rock left over from the system's nascent stage. The dust discovered in two samples from the asteroid is a substance that scientists believe was already well-mixed when the solar system formed, according to NASA. Because such high concentrations of it were detected in the samples, Bennu may have developed in a region \"enriched in the dust of dying stars,\" the agency said."
    },
    {
        "title": "National Signing Day tracker: Live updates for college football recruiting, commitments, rankings - CBS Sports",
        "url": "https://www.cbssports.com/college-football/news/national-signing-day-2025-tracker-live-updates-early-college-football-recruiting/live/",
        "published_at": "2025-12-03T17:20:54Z",
        "source": "CBS Sports",
        "body": "The first opportunity for high school prospects to lock up scholarships and sign financial aid agreements begins Wednesday and lasts through Friday during the early signing period. The first National Signing Day for the Class of 2026 has arrived, and as we've learned over the years, a vast majority of the nation's top players already made their college decisions by the time Wednesday came to a close. In other words, the early signing period shapes the way the Class of 2026 will look across the country come February, particularly for some of the nation's top teams.\n\nCBS Sports and 247Sports was here throughout the early signing period with live updates. Read on below for a recap of the notable commitments.\n\nMore from 2025 National Signing Day\n\nGrab a 247Sports subscription today to get inside scoop on your favorite team, expert analysis and opinion on all the day's biggest news and read content across the 247Sports network."
    },
    {
        "title": "YouTube Recap not showing up? Here's how to find yours right now - androidauthority.com",
        "url": "https://www.androidauthority.com/youtube-recap-2025-not-showing-up-how-find-3621750/",
        "published_at": "2025-12-03T15:39:11Z",
        "source": "Android Authority",
        "body": "Joe Maring / Android Authority\n\nWe’re officially at that time when almost every app has an end-of-year recap for you to watch. Music streamers like Spotify and Apple Music have offered this for a while, and now even apps like Google Photos have recap features.\n\nOne of the latest apps to join the recap bandwagon is YouTube. YouTube Recap launched earlier this week as a new way to see your last 12 months of YouTube activity distilled into a quick, flashy summary.\n\nIt’s something YouTube users have been asking for, but there’s just one problem: YouTube Recap isn’t showing up for many users. If you’re trying to find your YouTube Recap, here’s where to look.\n\nDo you like YouTube Recap? 1780 votes Yes 72 % No 15 % I don't care either way 13 %\n\nHow to find your YouTube Recap\n\nThere are a couple of ways to find your YouTube Recap, both of which are really simple. Starting with the YouTube Android app, it takes just a second to locate the Recap feature. Open the YouTube app. Tap the You tab on the bottom navigation bar. Tap the Your 2025 Recap is here banner near the top of the page. Alternatively, you can also access YouTube Recap from your desktop. To do this, navigate to youtube.com/recap. This will take you to your YouTube profile page, and just like on the mobile app, you should see a banner to watch your 2025 YouTube Recap.\n\nOnce you launch your Recap, you’ll tap through 20+ pages summarizing how you used YouTube in 2025. It’s a pretty robust recap feature, showing stats about your top interests, most-watched channels, how your viewing habits changed throughout the year, and more. The end includes a shortcut to watch your YouTube Music Recap, while controls at the bottom of your screen let you download or share your YouTube Recap.\n\nWhere is YouTube Recap available?\n\nJoe Maring / Android Authority\n\nYouTube Recap is available worldwide, but your location will determine how quickly you can access the feature. YouTube began rolling it out to users in North America first on December 2, while users in the rest of the world will get YouTube Recap “this week.”\n\nThat’s as specific as YouTube has gotten about its release plans, but the good news is that everyone should have YouTube Recap by Friday or Saturday.\n\nIf you live in North America and still don’t see YouTube Recap, or if we creep into next week and it remains MIA, it’s worth ensuring your YouTube app is updated to the latest version and that you’re logged into the right account. Outside of that, you shouldn’t need to do anything else for YouTube Recap to appear.\n\nDon’t want to miss the best from Android Authority? Set us as a favorite source in Google Discover to never miss our latest exclusive reports, expert analysis, and much more.\n\nto never miss our latest exclusive reports, expert analysis, and much more. You can also set us as a preferred source in Google Search by clicking the button below.\n\nFollow"
    },
    {
        "title": "Nintendo Offering 12 Months NSO Free With Switch 2 + Mario Kart World Bundle (UK) - Nintendo Life",
        "url": "https://www.nintendolife.com/news/2025/12/nintendo-offering-12-months-nso-free-with-switch-2-plus-mario-kart-world-bundle-uk",
        "published_at": "2025-12-03T15:32:08Z",
        "source": "Nintendo Life",
        "body": "We're in the thick of the Holiday season right now, so we're sure plenty of you are out there looking for sweet deals to stick under the tree come 25th December. And Nintendo is adding to the festive savings with is Nintendo Switch 2 + Mario Kart World bundle in the UK.\n\nOn the official Nintendo website, if you order the Switch 2 bundle, you'll get a Nintendo Switch Online 12-Month Individual Membership and a Luigi ornament for your Christmas tree — or shelf — for free. That's £429.99 for a new console, a game, NSO for a year, and a little bonus.\n\nThe deal is on until 11th January 2026 and, essentially, you're saving £58.97 compared to buying all four things individually, which would cost £488.96. Not a bad little saving, then.\n\nAll you have to do is click on the View Offer button, then add the Switch 2 bundle to your cart, and the additional items will be added automatically.\n\nWhile this deal is exclusive to the UK, it seems, we're sure other deals are popping up across the world, and we'll keep an eye out for the very best.\n\nSo even though Cyber Monday and Black Friday are in the past, the savings are still out there!\n\nPlease note that some external links on this page are affiliate links, which means if you click them and make a purchase we may receive a small percentage of the sale. Please read our FTC Disclosure for more information.\n\nAre you looking to get a Switch 2 for the Holiday season? Let us know in the comments."
    },
    {
        "title": "Owning a Smartphone at Age 12 Is Linked to These Health Issues in Kids - ScienceAlert",
        "url": "https://www.sciencealert.com/owning-a-smartphone-at-age-12-is-linked-to-these-health-issues-in-kids",
        "published_at": "2025-12-03T14:02:06Z",
        "source": "ScienceAlert",
        "body": "We're fast learning how smartphones impact childhood, and the findings of a new study about young tweens on the cusp of adolescence make for some more uncomfortable reading.\n\nResearchers in the US have found that owning a phone at the age of 12 was associated with an increased risk of depression, obesity, and insufficient sleep, compared to not having one.\n\nThe iPhone launched less than 20 years ago, so for many kids now entering their teenage years, they've only ever known a world with phones. Studies like this are trying to tease apart the effects.\n\n\"Our findings suggest that we should view smartphones as a significant factor in teen health, approaching the decision to give a child a phone with care and considering potential impacts on their life and health,\" says child and adolescent psychiatrist Ran Barzilay, from the Children's Hospital of Philadelphia.\n\nRelated: Screen Time In Bed May Increase Insomnia Odds, Study Suggests\n\nThe data from 10,588 young people, collected as part of an ongoing study on adolescent brain development, provided a snapshot of participants' health at age 12, together with some evidence for the differences that getting a phone (or not) over the next year might make.\n\nThe researchers factored in other variables, such as demographics and socioeconomic status, and found that at age 12, nearly 6.5 percent of those with phones had been given a diagnosis of depression, compared to roughly 4.5 percent without phones. That's a seemingly small but meaningful statistical difference.\n\nFor obesity, the respective figures were roughly 18 percent of smartphone users compared to 12 percent of 12-year-olds without these devices.\n\nAs for sleep, 47 percent of 12-year-olds with phones reported insufficient sleep (less than nine hours a night) compared to 31 percent of their phone-less peers.\n\nKids who had a phone by age 13 were more likely to report mental health problems (including depression) and insufficient sleep than those who didn't. However, there was no noticeable change in obesity risk over that year.\n\nThe researchers admit that phone use can have benefits, as other studies have shown, but they want to see more done to make sure that these devices are used responsibly.\n\n\"For many teens, smartphones can play a constructive role by strengthening social connections, supporting learning, and providing access to information and resources that promote personal growth,\" says Barzilay.\n\n\"Likewise, some families may view a smartphone as a necessity for safety or communication.\"\n\nThere are some nuances in the data. For example, depression was measured as any period of depression during the life of the child so far, so it may have occurred before they got a phone, in some cases.\n\nIt's also not possible to draw any conclusions about cause and effect in an observational study like this, but the strength of the associations – plus the changes that were recorded between ages 12 and 13 as some kids got phones and others didn't – are worth investigating further.\n\nThe findings tie in with what we know about adults and smartphones: that these devices can elevate stress, leave us feeling more distracted and drained, and reshape the way our brains are wired.\n\nIn future studies, the researchers want to look at how much screen time and different types of apps affect these results, how the findings might extend over longer periods of adolescence, and what countermeasures could be put in place.\n\n\"It's critical for young people to have time away from their phones to engage in physical activity, which can protect against obesity and enhance mental health over time,\" says Barzilay.\n\nThe research has been published in Pediatrics."
    },
    {
        "title": "Anacondas became massive 12 million years ago — and it worked so well, they haven't changed size since - Live Science",
        "url": "https://www.livescience.com/animals/snakes/anacondas-became-massive-12-million-years-ago-and-it-worked-so-well-they-havent-changed-size-since",
        "published_at": "2025-12-02T21:03:14Z",
        "source": "Live Science",
        "body": "Anacondas average between 13 and 16 feet (4 to 5 meters) long, the same length they've been for 12 million years.\n\nAnacondas have been giant for millions of years, a new study finds.\n\nThe enormous snakes' average body size has remained constant since they first appeared in the fossil record about 12.4 million years ago, during the Middle Miocene (16 million to 11.6 million years ago), researchers revealed in a new study published Monday (Dec. 1) in the Journal of Vertebrate Paleontology .\n\nDuring the Middle and Upper Miocene (12.4 million to 5.3 million years ago), warm temperatures, expansive wetlands and abundant food enabled many animal species to grow much larger than their modern relatives. But few of these giant animals have survived to the present day.\n\n\"Other species like giant crocodiles and giant turtles have gone extinct since the Miocene, probably due to cooling global temperatures and shrinking habitats,\" study co-author Andrés Alfonso-Rojas , a vertebrate paleontologist at the University of Cambridge, said in a statement . \"But the giant anacondas have survived — they are super-resilient.\"\n\nAnacondas make up a group of constricting snakes that today includes the heaviest snake species in the world . Modern anacondas average 13 to 16 feet (4 to 5 meters) in length, though the largest can reach up to 23 feet (7 m). Scientists weren't sure whether anacondas had been even larger during the Miocene, or whether they had been the same size and retained their massive size into the present day.\n\nTo estimate how big ancient anacondas might have been, Alfonso-Rojas and his colleagues measured 183 fossilized anaconda vertebrae from at least 32 individual snakes collected in Venezuela. They also used a technique called ancestral state reconstruction to predict the body lengths of ancient anacondas from characteristics of related snakes.\n\nResearchers measured fossilized anaconda vertebrae to determine the ancient snakes' body lengths. (Image credit: Jorge Carrillo-Briceño)\n\nBased on these calculations, the team found that anacondas averaged about 17 feet (5.2 m) long when they first appeared during the Miocene 12 million years ago — roughly the same length as modern anacondas.\n\nSign up for the Live Science daily newsletter now Get the world’s most fascinating discoveries delivered straight to your inbox. Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\n\"This is a surprising result because we expected to find the ancient anacondas were seven or eight meters [23 to 26 feet] long,\" Alfonso-Rojas said in the statement. \"But we don't have any evidence of a larger snake from the Miocene when global temperatures were warmer.\"\n\nIt's still unclear why anacondas have not become smaller over time.\n\nAlthough warm weather and abundant wetlands may have enabled anacondas to reach their giant size early in their evolutionary history, cooler temperatures and shrinking ranges haven't forced the snakes to get smaller to adapt. That could suggest that these weren't the primary factors keeping the snakes large in the intervening millennia, the researchers wrote in the study.\n\nPredator-prey interactions likely didn't play a major role in maintaining the snakes' body size, either, the researchers said. A lack of competition for food could have helped the snakes grow large in the first place. But they didn't get smaller as other predators moved into South America during the Pliocene (5.3 million to 2.6 million years ago) and the Pleistocene (2.6 million to 11,700 years ago), suggesting that food availability isn't a big factor in anacondas' giant size.\n\nSnake quiz: How much do you know about the slithering reptiles?"
    }
]